{"class_name": "Functional", "config": {"name": "squeezenet", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu_conv1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu_conv1", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pool1", "inbound_nodes": [[["relu_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire2/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire2/squeeze1x1", "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire2/relu_squeeze1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire2/relu_squeeze1x1", "inbound_nodes": [[["fire2/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire2/expand1x1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire2/expand1x1", "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire2/expand3x3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire2/expand3x3", "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire2/relu_expand1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire2/relu_expand1x1", "inbound_nodes": [[["fire2/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire2/relu_expand3x3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire2/relu_expand3x3", "inbound_nodes": [[["fire2/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "fire2/concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "fire2/concat", "inbound_nodes": [[["fire2/relu_expand1x1", 0, 0, {}], ["fire2/relu_expand3x3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire3/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire3/squeeze1x1", "inbound_nodes": [[["fire2/concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire3/relu_squeeze1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire3/relu_squeeze1x1", "inbound_nodes": [[["fire3/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire3/expand1x1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire3/expand1x1", "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire3/expand3x3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire3/expand3x3", "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire3/relu_expand1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire3/relu_expand1x1", "inbound_nodes": [[["fire3/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire3/relu_expand3x3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire3/relu_expand3x3", "inbound_nodes": [[["fire3/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "fire3/concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "fire3/concat", "inbound_nodes": [[["fire3/relu_expand1x1", 0, 0, {}], ["fire3/relu_expand3x3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pool3", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pool3", "inbound_nodes": [[["fire3/concat", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire4/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire4/squeeze1x1", "inbound_nodes": [[["pool3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire4/relu_squeeze1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire4/relu_squeeze1x1", "inbound_nodes": [[["fire4/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire4/expand1x1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire4/expand1x1", "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire4/expand3x3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire4/expand3x3", "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire4/relu_expand1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire4/relu_expand1x1", "inbound_nodes": [[["fire4/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire4/relu_expand3x3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire4/relu_expand3x3", "inbound_nodes": [[["fire4/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "fire4/concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "fire4/concat", "inbound_nodes": [[["fire4/relu_expand1x1", 0, 0, {}], ["fire4/relu_expand3x3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire5/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire5/squeeze1x1", "inbound_nodes": [[["fire4/concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire5/relu_squeeze1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire5/relu_squeeze1x1", "inbound_nodes": [[["fire5/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire5/expand1x1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire5/expand1x1", "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire5/expand3x3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire5/expand3x3", "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire5/relu_expand1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire5/relu_expand1x1", "inbound_nodes": [[["fire5/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire5/relu_expand3x3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire5/relu_expand3x3", "inbound_nodes": [[["fire5/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "fire5/concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "fire5/concat", "inbound_nodes": [[["fire5/relu_expand1x1", 0, 0, {}], ["fire5/relu_expand3x3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["fire5/concat", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv10", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv10", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu_conv10", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu_conv10", "inbound_nodes": [[["conv10", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_average_pooling2d_1", "inbound_nodes": [[["relu_conv10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "drop11", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "drop11", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "loss", "trainable": true, "dtype": "float32", "activation": "softmax"}, "name": "loss", "inbound_nodes": [[["drop11", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["loss", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}